ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/HSM/f29h85x_hsm_sm4_regs.xml
<module id="HSM_SM4" HW_revision="" description="HSM SM4 Registers">
	<register id="SM4_DATA_IN_0" width="32" page="0" offset="0" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_DATA_IN_1" width="32" page="0" offset="4" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_DATA_IN_2" width="32" page="0" offset="8" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_DATA_IN_3" width="32" page="0" offset="12" internal="0" description="">
		<bitfield id="DATA_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_KEY_IN_0" width="32" page="0" offset="32" internal="0" description="">
		<bitfield id="KEY_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_KEY_IN_1" width="32" page="0" offset="36" internal="0" description="">
		<bitfield id="KEY_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_KEY_IN_2" width="32" page="0" offset="40" internal="0" description="">
		<bitfield id="KEY_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_KEY_IN_3" width="32" page="0" offset="44" internal="0" description="">
		<bitfield id="KEY_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_PARAM_IN_0" width="32" page="0" offset="64" internal="0" description="">
		<bitfield id="PARAM_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_PARAM_IN_1" width="32" page="0" offset="68" internal="0" description="">
		<bitfield id="PARAM_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_PARAM_IN_2" width="32" page="0" offset="72" internal="0" description="">
		<bitfield id="PARAM_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_PARAM_IN_3" width="32" page="0" offset="76" internal="0" description="">
		<bitfield id="PARAM_IN" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_CTRL_STAT" width="32" page="0" offset="80" internal="0" description="">
		<bitfield id="OUT_BUF_FULL" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DATA_IN_AV" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MODE_IN_AV" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="KEY_IN_AV" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PARAM_IN_AV" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="IV_IN_AV" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RFD_IN_AV" description="" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="RESERVED_0" description="" begin="31" end="7" width="25" rwaccess="R"/>
	</register>
	<register id="SM4_MODE" width="32" page="0" offset="84" internal="0" description="">
		<bitfield id="DIRECTION" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DECRYPT_KEY" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ECB" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CBC" description="" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CTR" description="" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OFB" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CFB" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="RESERVED_0" description="" begin="31" end="7" width="25" rwaccess="R"/>
	</register>
	<register id="SM4_DATA_OUT_0" width="32" page="0" offset="88" internal="0" description="">
		<bitfield id="DATA_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM4_DATA_OUT_1" width="32" page="0" offset="92" internal="0" description="">
		<bitfield id="DATA_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM4_DATA_OUT_2" width="32" page="0" offset="96" internal="0" description="">
		<bitfield id="DATA_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM4_DATA_OUT_3" width="32" page="0" offset="100" internal="0" description="">
		<bitfield id="DATA_OUT" description="" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SM4_IV_IN_OUT_0" width="32" page="0" offset="104" internal="0" description="">
		<bitfield id="IV" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_IV_IN_OUT_1" width="32" page="0" offset="108" internal="0" description="">
		<bitfield id="IV" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_IV_IN_OUT_2" width="32" page="0" offset="112" internal="0" description="">
		<bitfield id="IV" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_IV_IN_OUT_3" width="32" page="0" offset="116" internal="0" description="">
		<bitfield id="IV" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="SM4_CONFIG" width="32" page="0" offset="248" internal="0" description="">
		<bitfield id="CYCLE_SPEED" description="" begin="2" end="0" width="3" rwaccess="R"/>
		<bitfield id="RESERVED_0" description="" begin="5" end="3" width="3" rwaccess="R"/>
		<bitfield id="DECRYPT_SUPPORT" description="" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ENCRYPT_SUPPORT" description="" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="RESERVED_1" description="" begin="31" end="8" width="24" rwaccess="R"/>
	</register>
	<register id="SM4_VERSION" width="32" page="0" offset="252" internal="0" description="">
		<bitfield id="EIP_NUMBER" description="" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="COMPLEMENT_OF_EIP_NUMBER" description="" begin="15" end="8" width="8" rwaccess="R"/>
		<bitfield id="PATCH_LEVEL" description="" begin="19" end="16" width="4" rwaccess="R"/>
		<bitfield id="MINOR_VERSION_NUMBER" description="" begin="23" end="20" width="4" rwaccess="R"/>
		<bitfield id="MAJOR_VERSION_NUMBER" description="" begin="27" end="24" width="4" rwaccess="R"/>
		<bitfield id="RESERVED_0" description="" begin="31" end="28" width="4" rwaccess="R"/>
	</register>
	<register id="SM4_SYSCONFIG" width="32" page="0" offset="256" internal="0" description="SM4 sysconfig registers">
		<bitfield id="AUTO_CTRL" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="NEED_IV_OUT" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_DATA_IN_EN" description="" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_DATA_OUT_EN" description="" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_CONTEXT_IN_EN" description="" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DMA_REQ_CONTEXT_OUT_EN" description="" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="SM4_IRQSTATUS" width="32" page="0" offset="260" internal="0" description="SM4 irqstatus registers">
		<bitfield id="CONTEXT_IN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DATA_IN" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DATA_OUT" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CONTEXT_OUT" description="" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SM4_IRQENABLE" width="32" page="0" offset="264" internal="0" description="SM4 irqenable registers">
		<bitfield id="CONTEXT_IN" description="" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DATA_IN" description="" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DATA_OUT" description="" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CONTEXT_OUT" description="" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SM4_LENGTH" width="32" page="0" offset="268" internal="0" description="SM4 length registers">
		<bitfield id="LENGTH" description="" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
</module>
